#Generated by ResourceBundle Editor (http://essiembre.github.io/eclipse-rbe/)

domain.cmap                          = Mapa conceptual
domain.cmap.cmaps                    = Mapas conceptuales
domain.cmap.hasConcepts              = Conceptos cubiertos
domain.cmap.notHasConcepts           = Conceptos sin cubrir
domain.feature                       = Caracter\u00EDstica
domain.feature.default               = Seleccionada por defecto
domain.feature.features              = Caracter\u00EDsticas
domain.feature.mandatory             = Caracter\u00EDsticas obligatorias
domain.feature.name                  = Nombre
domain.feature.optional              = Caracter\u00EDsticas opcionales
domain.feature.properties            = Propiedades
domain.feature.selected              = Caracter\u00EDsticas seleccionadas
domain.feature.type                  = Tipo de variaci\u00F3n
domain.feature.type.alternative      = Alternativa
domain.feature.type.alternative.help = En un conjunto de caracter\u00EDsticas, esta variaci\u00F3n requiere <b>seleccionar s\u00F3lo una</b> de ellas
domain.feature.type.mandatory        = Obligatoria
domain.feature.type.mandatory.help   = Las caracter\u00EDsticas obligatorias son las que <b>no pueden ser deseleccionadas</b>
domain.feature.type.optional         = Opcional
domain.feature.type.optional.help    = Las caracter\u00EDsticas opcionales son aquellas que <b> pueden ser seleccionadas o no </b>
domain.feature.type.or               = O
domain.feature.type.or.help          = En un conjunto de caracter\u00EDsticas, esta variaci\u00F3n permite <b>seleccionar una o m\u00E1s</b> de ellas
domain.feature.type.unk              = <i>Desconocida</i>
domain.feature.type.unk.help         = Tipo desconocido
domain.feature.unselected            = Caracter\u00EDsticas sin seleccionar
domain.product                       = Producto
domain.product.configuration         = Configuraci\u00F3n
domain.product.products              = Productos
domain.product.size                  = Tama\u00F1o del producto
domain.spl                           = LPS
domain.spl.changeSelected            = Para elegir otra
domain.spl.long                      = L\u00EDnea de Producto de Software
domain.spl.selectedIs                = La LPS elegida:
domain.vp.codeLevel                  = Puntos de variaci\u00F3n a nivel de c\u00F3digo
domain.vp.codeLevel.short            = C\u00F3digo
domain.vp.dirLevel                   = Puntos de variaci\u00F3n a nivel de directorio
domain.vp.dirLevel.short             = Directorio
domain.vp.fileLevel                  = Puntos de variaci\u00F3n a nivel de fichero
domain.vp.fileLevel.short            = Fichero
domain.vp.partLevel                  = Puntos de variaci\u00F3n a nivel de secci\u00F3n part
domain.vp.partLevel.short            = Secci\u00F3n

lang = Idioma

lang.basic.no  = No
lang.basic.yes = S\u00ED
lang.en        = Ingl\u00E9s
lang.es        = Castellano
lang.eu        = Vasco

link.back       = Atr\u00E1s
link.cancel     = Cancelar
link.examine    = Examinar
link.github     = Repositorio GitHub
link.go         = Ir
link.here       = haz click aqu\u00ED
link.next       = Siguiente
link.next.short = Sig.
link.prev       = Anterior
link.prev.short = Ant.
link.show       = Ver

tour = Tour para principiantes

tour.begin                       = Empezar el tour
tour.changespl.content           = Si quieres cambiar de LPS, haz click aqu\u00ED.
tour.cmap.content                = Un mapa conceptual est\u00E1 compuesto por tres elementos: conceptos, flechas y frases de enlace. Las frases de enlace se utilizan para explicar la relaci\u00F3n entre conceptos.<br>Los conceptos y las frases de enlace pueden relacionarse con una caracter\u00EDstica de la LPS y otros recursos.<br>Para ampliar la informaci\u00F3n sobre cualquiera de estos elementos, se puede hacer clic en ellos y aparecer\u00E1 una ventana a la derecha de la pantalla.
tour.cmaps.content               = Estos son los mapas conceptuales de la LPS.
tour.cmaps.title                 = Mapas conceptuales
tour.cmapsviewgo.content         = Aqu\u00ED examinar\u00E1s los mapas conceptuales relacionados con esta LPS. Haz clic aqu\u00ED para ver la vista.
tour.compare.content             = Selecciona dos productos distintos para hacer la comparaci\u00F3n.
tour.compare.title               = Comparaci\u00F3n de productos
tour.comparebtn.content          = Haz click aqu\u00ED para comparar diferentes productos.
tour.comparebtn.content2         = \u00A1Haz click y compara!
tour.config.content              = Para crear un producto, hay que decidir qu\u00E9 caracter\u00EDsticas se seleccionar\u00E1n y cu\u00E1les no. Esta decisi\u00F3n es la configuraci\u00F3n del producto o <i>Variant Model</i>.<br>Aqu\u00ED se puede ver una representaci\u00F3n de su configuraci\u00F3n.<br>Esta configuraci\u00F3n est\u00E1 vinculada con el gr\u00E1fico, por lo que si se hace clic en una caracter\u00EDstica seleccionada ($selectedImg) el gr\u00E1fico se centrar\u00E1 en ella.
tour.config.title                = Configuraci\u00F3n del producto
tour.configtogle.content         = Haz click aqu\u00ED para examinar la configuraci\u00F3n de este producto.
tour.detailedgraphic.content     = Este gr\u00E1fico muestra cu\u00E1nto c\u00F3digo condicional se utiliza para crear este producto, siendo el valor central del gr\u00E1fico su cobertura de c\u00F3digo. El c\u00F3digo condicional se conoce como <i>Variation Point (VP)</i> y cada VP est\u00E1 relacionado con algunas de las caracter\u00EDsticas del SPL.<br>Algunas explicaciones:<br><ul><li>Los elementos <b>en gris</b> representan el c\u00F3digo que est\u00E1 cubierto por caracter\u00EDsticas no seleccionadas.</li><li>Los elementos <b>de color</b> representan el c\u00F3digo que est\u00E1 cubierto por las caracter\u00EDsticas seleccionadas en este producto.</li><li>Las caracter\u00EDsticas seleccionadas est\u00E1n organizadas en niveles, siendo la de nivel superior hija de la de nivel inferior (se entender\u00E1 mejor en la configuraci\u00F3n).</li><li>Colocando el rat\u00F3n <b>sobre una caracter\u00EDstica</b> se mostrar\u00E1 el tama\u00F1o de sus VP.</li><li><b>Al hacer clic</b> en un rasgo se centrar\u00E1 el gr\u00E1fico en esa secci\u00F3n, lo que permite determinar el impacto de un rasgo en el porcentaje de cobertura del c\u00F3digo.</li></ul>
tour.detailedgraphic.title       = Cobertura de c\u00F3digo del producto
tour.detailedgraphichelp.content = Si necesitas volver a consultar las explicaciones de este gr\u00E1fico, haz click en este bot\u00F3n de ayuda.
tour.end                         = Terminar
tour.end.content                 = Has completado el tour y has llegado al final. \u00A1Ahora es tu turno de explorar!
tour.end.title                   = F\u00EDn
tour.feature.content             = En esta p\u00E1gina se puede encontrar toda la informaci\u00F3n sobre esta caracter\u00EDstica:\n<ul><li><b>\u00C1rbol de caracter\u00EDsticas inmediatas:</b> padre e hijos de la caracter\u00EDstica.</li><li><b>Informaci\u00F3n:</b> informaci\u00F3n general de la caracter\u00EDstica.</li><li><i>(opcional)</i><b>Propiedades:</b> atributos de la caracter\u00EDstica, si los hay.</li><li><i>(opcional)</i><b>Mapas conceptuales:</b> relaciones entre la caracter\u00EDstica y los mapas conceptuales, si las hay.</li><li><i>(opcional)</i><b>Puntos de variaci\u00F3n:</b> variaciones generadas por la caracter\u00EDstica al crear productos, si las hay.</li></ul>\nTendr\u00E1s tiempo para comprobar esto. \u00A1Continuemos!
tour.featurego.content           = Haz clic aqu\u00ED para ver la informaci\u00F3n de esta caracter\u00EDstica.
tour.featuremodels.content       = Estos son los modelos de caracter\u00EDsticas de la LPS. Un modelo de caracter\u00EDsticas representa todas las caracter\u00EDsticas de una LPS, sus relaciones y tipos de variaci\u00F3n (obligatorio, opcional...).
tour.featuremodels.title         = Modelos de caracter\u00EDsticas
tour.featureviewgo.content       = Aqu\u00ED tendr\u00E1 la oportunidad de examinar las caracter\u00EDsticas de la LPS. Haz clic aqu\u00ED para ver la vista de producto.
tour.filters.content             = Aqu\u00ED encontrar\u00E1s los filtros para aplicar a los productos.
tour.firstcmapgo.content         = Haz clic aqu\u00ED para ver este mapa conceptual.
tour.firstprod.content           = Este gr\u00E1fico muestra cu\u00E1ntas de las caracter\u00EDsticas de SPL tienen que ser seleccionadas para crear este producto. Cuantas m\u00E1s caracter\u00EDsticas se seleccionen, m\u00E1s complejo ser\u00E1 el producto creado.<br><ul><li>El <b>azul claro</b> representa las caracter\u00EDsticas obligatorias (seleccionadas por defecto)</li><li>El <b>azul oscuro</b> las caracter\u00EDsticas opcionales que est\u00E1n seleccionadas.</li><li>Por \u00FAltimo, <b>el gris</b> representa las caracter\u00EDsticas no seleccionadas.</li></ul>Haz click en el gr\u00E1fico para examinar este producto.
tour.firstprod.title             = Representaci\u00F3n del producto
tour.firstspl.content            = Haz click aqu\u00ED para examinar esta LPS.
tour.insidespl.content           = Esta aplicaci\u00F3n te ayudar\u00E1 a expandir tu conocimiento acerca de las L\u00EDneas de Producto de Software (LPS). \u00A1Empezemos con el tour!
tour.insidespl.title             = \u00A1Bienvenido/a a InsideSPL!
tour.need                        = \u00BFNo sabes por d\u00F3nde empezar?
tour.products.content            = Estos son los productos de la LPS seleccionada. En el mundo de las LPS los productos son conocidos como <i>variantes</i>.
tour.products.title              = Productos
tour.productviewgo.content       = Aqu\u00ED tendr\u00E1 la oportunidad de examinar los productos o <i>Variant Models</i> de la LPS. Haz click aqu\u00ED para examinar la vista de producto.
tour.similarity.content          = Este es el resultado de la comparaci\u00F3n entre los dos productos.<br>Tendr\u00E1s tiempo para comprobar todo esto m\u00E1s tarde, veamos otra vista.
tour.similarity.title            = Parecido
tour.spllist.content             = Aqu\u00ED se muestran las LPS accesibles a trav\u00E9s de la aplicaci\u00F3n.
tour.spllist.title               = Lista de LPS
tour.splviews.content            = Aqu\u00ED se muestran diferentes vistas para examinar una LPS, cada una de ellas centrada en una parte distinta del conocimiento de las LPS.
tour.splviews.title              = Vistas
tour.zoombuttons.content         = Aqu\u00ED puedes controlar el zoom del gr\u00E1fico.

views.cmaps                    = Mapas conceptuales
views.cmaps.description        = Un mapa conceptual o diagrama conceptual es un diagrama que representa ideas e informaci\u00F3n en una estructura jer\u00E1rquica descendente.<br>Estos mapas est\u00E1n formados por tres elementos b\u00E1sicos: conceptos, flechas y frases de enlace. Las frases de enlace se utilizan para explicar las relaciones entre conceptos.
views.cmaps.features           = Caracter\u00EDsticas relacionadas
views.cmaps.incoming           = Relaciones entrantes
views.cmaps.list               = Lista
views.cmaps.outgoing           = Relaciones salientes
views.cmaps.products           = Examinar los productos
views.cmaps.resources          = Recursos
views.feature.go               = Examinar caracter\u00EDstica
views.feature.immediateFTree   = Arbol de caracter\u00EDsticas inmediatas
views.feature.information      = Informaci\u00F3n
views.feature.moreInfo         = Informaci\u00F3n sobre<br>la caracter\u00EDstica
views.feature.relatedFeatures  = Conceptos y frases de enlace relacionados
views.feature.relatedResources = Recursos relacionados
views.feature.vps              = Puntos de variaci\u00F3n
views.featureModel             = Vista de caracter\u00EDsticas
views.featureModel.description = Esta vista muestra los modelos de caracter\u00EDsticas (<i>Feature Model</i>, en ingl\u00E9s) de la LPS seleccionada. Un modelo de caracter\u00EDsticas es una estructura que recoge todas las caracter\u00EDsticas de un SPL, las relaciones entre ellas y su variabilidad (opcional, obligatorio...)
views.filters                  = Filtros
views.index                    = Inicio
views.index.lastChange         = \u00DAltima actualizaci\u00F3n en el repositorio Git
views.productView              = Vista de producto
views.productView.comparation  = Comparaci\u00F3n
views.productView.compare      = Comparar
views.productView.description  = Esta vista ofrece datos sobre los diferentes productos de la LPS: la cantidad de caracter\u00EDsticas, cobertura de c\u00F3digo y comparaci\u00F3n entre productos.<br>\nUn producto es una configuraci\u00F3n concreta de los componentes de la LPS.
views.productView.doCompare    = Compara estos productos
views.productView.noProduct    = \u00A1No hay ning\u00FAn producto!
views.productView.products     = Productos
